AUTHORS = [
    "Джордж Оруэлл",
    "Фёдор Достоевский",
    "Джоан Роулинг",
    "Лев Толстой",
    "Фрэнсис Скотт Фицджеральд",
    "Эрих Мария Ремарк",
    "Габриэль Гарсиа Маркес",
    "Джером Сэлинджер",
    "Джордж Мартин",
    "Харпер Ли",
    "Михаил Булгаков",
    "Эрнест Хемингуэй",
    "Агата Кристи",
    "Антуан де Сент-Экзюпери",
    "Дэн Браун",
    "Стивен Кинг",
    "Джон Толкин",
    "Айн Рэнд",
    "Рэй Брэдбери",
    "Фрэнк Герберт"
]

TITLES = [
    "1984",
    "Преступление и наказание",
    "Гарри Поттер и философский камень",
    "Война и мир",
    "Великий Гэтсби",
    "Три товарища",
    "Сто лет одиночества",
    "Над пропастью во ржи",
    "Игра престолов",
    "Убить пересмешника",
    "Мастер и Маргарита",
    "Старик и море",
    "Убийство в Восточном экспрессе",
    "Маленький принц",
    "Код да Винчи",
    "Оно",
    "Властелин колец: Братство кольца",
    "Атлант расправил плечи",
    "451 градус по Фаренгейту",
    "Дюна"
]

GENRES = [
    "Антиутопия",
    "Психологический роман",
    "Фэнтези",
    "Исторический роман",
    "Классическая литература",
    "Любовный роман",
    "Магический реализм",
    "Роман взросления",
    "Эпическое фэнтези",
    "Социальная драма",
    "Мистика",
    "Повесть",
    "Детектив",
    "Философская сказка",
    "Триллер",
    "Хоррор",
    "Высокое фэнтези",
    "Философский роман",
    "Научная фантастика",
    "Научная фантастика"
]

YEARS = [
    1949,
    1866,
    1997,
    1869,
    1925,
    1936,
    1967,
    1951,
    1996,
    1960,
    1967,
    1952,
    1934,
    1943,
    2003,
    1986,
    1954,
    1957,
    1953,
    1965
]

NARRATORS = [
    "Волков А.Н.",
    "Семёнова М.И.",
    "Кузнецов П.С.",
    "Орлова Е.В.",
    "Жуков Д.К.",
    "AI"
]

EBOOK_FORMATS = [
    "PDF",
    "EPUB",
    "MOBI",
    "AZW3",
    "FB2",
    "TXT",
    "DOCX",
    "RTF",
    "HTML",
]
